app/views/events/index.html.erb

        <h6 class="card-subtitle">Créé par : </h6>
        <p class="card-text"> <%= event.user.first_name %> <%= event.user.last_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]