app/controllers/events_controller.rb

  def create
    @event = Event.new(title: params[:title], user_id: current_user.id , description: params[:description], location: params[:location], duration: params[:duration], start_date: params[:start_date], price: params[:price])

    if @event.save
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"