app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    if current_user.id != @user.id
      redirect_to events_path
    else

    end

    @user_events= []
    Event.all.each do |event|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "description" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "hadrien"], ["last_name", "samouillan"], ["description", "qerstxdcfuvygbhnji,ok"], ["updated_at", "2020-02-18 15:49:26.287209"], ["id", 1]]